# Pandas py practice
Author: Joe Acosta
Date: 07/17/2025

Day 1: Creating yaml file to automatically create Conda env, learn how to use Conda and how to download MiniConda

Day 2: Start Course and Practice Recreating Conda env

Day 3: Reviewed Pandas info -> Pandas is built on NumPy and uses MatPlotLib to visualize the data

In [1]:
# Imports
import pandas as pd
import seaborn as sns

In [2]:
# Gets the titanic dataset from the sns dataset
titanic_df = sns.load_dataset('titanic')

In [4]:
print(type(titanic_df))

<class 'pandas.core.frame.DataFrame'>

In [3]:
# Gets the data type of the titanic dataset to verify if it's pandas dfS
titanic_df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

Get the DataFrame information

In [5]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

How many people were on the titanic?

In [6]:
titanic_df.shape

(891, 15)

In [7]:
len(titanic_df)

891

What are the different columns?

In [8]:
titanic_df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

Get the Top 10 and Bottom 5

In [9]:
titanic_df.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [10]:
titanic_df.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

Get 5 random passangers

In [13]:
titanic_df.sample(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
86,0,3,male,16.0,1,3,34.3750,S,Third,man,True,NaN,Southampton,no,False
769,0,3,male,32.0,0,0,8.3625,S,Third,man,True,NaN,Southampton,no,True
627,1,1,female,21.0,0,0,77.9583,S,First,woman,False,D,Southampton,yes,True
437,1,2,female,24.0,2,3,18.7500,S,Second,woman,False,NaN,Southampton,yes,False
421,0,3,male,21.0,0,0,7.7333,Q,Third,man,True,NaN,Queenstown,no,True

Get Single Passenger

In [15]:
titanic_df.sample()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
854,0,2,female,44.0,1,0,26.0,S,Second,woman,False,NaN,Southampton,no,False

Get the passenger # 342's information

In [16]:
titanic_df.loc[342]

survived                 0
pclass                   2
sex                   male
age                   28.0
sibsp                    0
parch                    0
fare                  13.0
embarked                 S
class               Second
who                    man
adult_male            True
deck                   NaN
embark_town    Southampton
alive                   no
alone                 True
Name: 342, dtype: object

Was Passenger #121 an adult male?

In [17]:
# first checked the columns
titanic_df.loc[121, 'adult_male']

np.True_

What was the oldest passengers age?

In [18]:
titanic_df.age.max()

np.float64(80.0)

Get all statistics for the passenger ages

In [19]:
titanic_df.age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

What are the ages and sex of passengers 123, 153, and 232

In [20]:
titanic_df.loc[[123, 153, 232], ['age', 'sex']]

      age     sex
123  32.5  female
153  40.5    male
232  59.0    male

Order the passengers descending by age and print the results

In [22]:
titanic_df.sort_values(by='age', ascending=False)
# having issues remembering how to sort right meow

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,yes,True
851,0,3,male,74.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

Which passenger had an age of 14.5

In [23]:
titanic_df[titanic_df.age == 14.5]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
111,0,3,female,14.5,1,0,14.4542,C,Third,child,False,NaN,Cherbourg,no,False

What were all the unique ages of the passengers

In [26]:
titanic_df.age.unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

How many different classes did the Titanic have?

In [30]:
titanic_df['class'].nunique()

3

How many Passengers were in each class?

In [33]:
titanic_df.groupby('class').size()

C:\Users\Drago\AppData\Local\Temp\ipykernel_30300\2669909667.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic_df.groupby('class').size()

class
First     216
Second    184
Third     491
dtype: int64

In [35]:
titanic_df['class'].value_counts()

class
Third     491
First     216
Second    184
Name: count, dtype: int64

What are the top 5 ages?

In [39]:
titanic_df.age.value_counts().head()

age
24.0    30
22.0    27
18.0    26
28.0    25
30.0    25
Name: count, dtype: int64

What percent of the passengers are represented by the top 5 ages?

In [43]:
top_age = titanic_df.age.value_counts().head()
top_age / len(titanic_df)

age
24.0    0.033670
22.0    0.030303
18.0    0.029181
28.0    0.028058
30.0    0.028058
Name: count, dtype: float64

In [45]:
top_age.sum() / len(titanic_df)

np.float64(0.14927048260381592)

Who was the youngest first class passenger

In [48]:
titanic_df.loc[titanic_df['class'] == 'First', 'age'].min()

np.float64(0.92)

In [50]:
titanic_df.loc[titanic_df['class'] == 'First'].sort_values(by='age', ascending=True)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
305,1,1,male,0.92,1,2,151.5500,S,First,child,False,C,Southampton,yes,False
297,0,1,female,2.00,1,2,151.5500,S,First,child,False,C,Southampton,no,False
445,1,1,male,4.00,0,2,81.8583,S,First,child,False,A,Southampton,yes,False
802,1,1,male,11.00,1,2,120.0000,S,First,child,False,B,Southampton,yes,False
435,1,1,female,14.00,1,2,120.0000,S,First,child,False,B,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
766,0,1,male,NaN,0,0,39.6000,C,First,man,True,NaN,Cherbourg,no,True
793,0,1,male,NaN,0,0,30.6958,C,First,man,True,NaN,Cherbourg,no,True
815,0,1,male,NaN,0,0,0.0000,S,First,man,True,B,Southampton,no,True
839,1,1,male,NaN,0,0,29.7000,C,First,man,True,C,Cherbourg,yes,True
849,1,1,female,NaN,1,0,89.1042,C,First,woman,False,C,Cherbourg,yes,False

What was the average ticket price, the max ticket price, and the min ticket price

In [51]:
titanic_df.fare.describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: fare, dtype: float64

How many passengers didn't pay for a ticket?

In [53]:
(titanic_df.fare == 0).sum()

np.int64(15)

The oldest passenger was 80, what class did they belong to

In [54]:
titanic_df.loc[titanic_df.age == titanic_df.age.max(), 'class']

630    First
Name: class, dtype: category
Categories (3, object): ['First', 'Second', 'Third']

How Many people in each class survived and what percentages in each class survived?

In [71]:
survival = titanic_df.groupby(['survived', 'class']).size().unstack(fill_value=0)

C:\Users\Drago\AppData\Local\Temp\ipykernel_30300\401245616.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  survival = titanic_df.groupby(['survived', 'class']).size().unstack(fill_value=0)

In [80]:
survival.loc[1] / survival.sum()

class
First     0.629630
Second    0.472826
Third     0.242363
dtype: float64